[
    {
        "id": 1,
        "name": "Pastafrola",
        "ingredients": [
            "Huevo 1",
            "Yema 1",
            "Harina leudante 400 grs",
            "Azúcar 200 gr",
            "Manteca 200 gr",
            "Esencia de vainilla 1cda",
            "Sal 1 cdta",
            "Dulce de membrillo 200 grs",
            "Dulce de batata 200 grs",
            "Agua c/n"
        ],
        "steps": [
            "Lo primero que vamos a hacer es poner en un bol la manteca cortada en cubitos. Que no esté super fría ni muy derretida. La vamos a batir con el azúcar hasta que se forme una crema clarita y bien lisa",
            "Ahora vamos a sumar el huevo y la yema, la esencia de vainilla y la ralladura de limón, y volvemos a batir. No se asusten si al principio parece que la mezcla se “corta”, es hasta que las yemas se integren bien con la manteca",
            "Cuando la preparación esté unida y lisa de nuevo, vamos a dejar de lado la batidora y agarrar una espátula. Agregamos el harina leudante y la vamos incorporando con la espátula hasta que se pueda mezclar con las manos. La idea es integrar la masa, no amasarla como un pan! Una vez que esté bien unida, la ponemos en un film y la llevamos a la heladera 30 minutos",
            "Mientras vamos con el relleno de pasta frola: cortamos el dulce (o los dulces en mi caso) en cubitos, lo ponemos en un bol, agregamos una cucharada de agua aproximadamente y lo llevamos al microondas un minuto a potencia media para derretirlo. Cuando sale, lo aplastamos con un tenedor o un pisapapas. Tengamos cuidado en esta parte, porque el dulce de membrillo se calienta y quema mucho!",
            "Sacamos la masa de la heladera y vamos a armar la base en un molde con la técnica de los capos n°1, aplastándola con el puño y un film. (en el video se ve clarísimo). Acomodamos los bordes y rellenamos la pasta frola con los dulces de membrillo y batata derretidos",
            "Ahora viene la magia de la técnica de los capos n°3: la decoración. Ponemos la masa entre dos films, la estiramos y la mandamos al congelador. Sacamos el film de arriba y cortamos con una cuchilla las tiras, prestado atención de cortar el film de abajo también. Después levantamos desde el film la tira y la ponemos directamente sobre el relleno, cuando esté bien acomodada, sacamos el film y listo!",
            "La llevamos al horno a 200° por unos 40 minutos o hasta que esté doradita"
        ],
        "imgUrl": "https://www.paulinacocina.net/wp-content/uploads/2020/08/pasta-frola2-640x480.png",
        "videoUrl": "https://www.youtube.com/embed/NfX-AHIyiBM?si=AX_slCBkv294Hfpw",
        "description": [
            "Pastafrola es una tarta artesanal típica de la gastronomía de Italia, Egipto, Grecia, Paraguay, Argentina y Uruguay. Su día internacional es el 18 de julio, se compone de una masa cubierta tradicionalmente con dulce de batata o dulce de membrillo. Existen variantes con dulce de guayaba que es característico de la gastronomía paraguaya.2​ En Argentina y Uruguay también puede hacerse con dulce de leche o crema pastelera.3​ Es adornada con tiras delgadas de la misma masa, dando forma de cuadriculado romboidal sobre la capa de dulce. La cocción es al horno y es un acompañamiento típico de la merienda o del mate, o a toda hora del día."
        ]
    },
    {
        "id": 2,
        "name": "Bizcocho de Chocolate",
        "ingredients": [
            "3 huevos",
            "1 taza de azúcar negra (puede ser blanca también, es solo por el efecto del color)",
            "1/2 taza de aceite",
            "150g. de chocolate semiamargo",
            "1 y 1/2 taza de harina leudante",
            "1 chorro leche"
        ],
        "steps": [
            "En un bol vamos a poner la azúcar negra con los 3 huevos. Vamos a batir (a mano o con batidora) hasta que los ingredientes estén bien incorporados entre sí",
            "Una vez que esté bien mezclada el azúcar con los huevos, vamos a agregar el aceite. Seguimos batiendo",
            "Ahora, agregamos una taza de harina leudante, tamizándola con un coladorcito para darle aire a la preparación. Todavía nos queda media taza reservada. Mezclamos bien",
            "Lo que vamos a hacer ahora es cortar el chocolate amargo en trocitos y llevarlo al microondas en tandas de 30 segundos, mezclándolo con una cuchara entre tanda y tanda hasta que lo vean bien derretido. Tengan cuidado ¡que no se les vaya a quemar! Una vez derretido, lo incorporamos a la mezcla anterior y mezclamos bien nuevamente",
            "Ahora  es el momento de incorporar la media taza de harina leudante que nos quedó, también con tamizador. Unimos con una espátula hasta incorporar bien",
            "Una vez que esté todo bien homogéneo, vamos a agregarle el chorrito de leche. La incorporamos bien",
            "Ahora sí, vamos a enmantecar y enharinar un molde y a volcar toda nuestra hermosa mezcla chocolatosa adentro. Lo vamos a llevar a horno 180º por aproximadamente 40 minutos",
            "Pasado este tiempo y luego de hacer la prueba del tenedor (si lo introducen en la torta y sale seco, quiere decir que el bizcochuelo ya está bien cocido) lo retiran del horno ¡y listo!"
        ],
        "imgUrl": "https://www.paulinacocina.net/wp-content/uploads/2020/08/okokok-640x480.jpg",
        "videoUrl": "https://www.youtube.com/embed/rqgc5jVT5Sw?si=Zi3PlOdtQ51DP_9X",
        "description": [
            "Es un postre conocido internacionalmente, que se popularizó a finales del siglo xix y se sirve frecuentemente en reuniones, como fiestas de cumpleaños y bodas. Los ingredientes pueden variar dependiendo de la receta, pero por lo general incluyen una combinación de huevos, azúcar, polvo de cacao, chocolate, mantequilla o aceite, agua o leche, sal y bicarbonato de sodio. Otras variaciones pueden incluir chocolate derretido, crema ácida, suero de mantequilla, jugo de frutas o jarabes",
            "Los panaderos usan extracto de vainilla, licores o líquidos condimentados como el café, para añadir diferentes gustos al sabor del chocolate. Se usan además una variedad de decorados, escarchados o glaseados, así como especias"
        ]
    },
    {
        "id": 3,
        "name": "Bizcocho de Naranja",
        "ingredients": [
            "4 huevos",
            "200 g de azúcar",
            "250 g de harina",
            "1 cucharada de polvo de hornear o leudante",
            "100 ml de aceite de girasol",
            "120 ml de jugo de naranja",
            "Ralladura de 1 naranja",
            "Manteca para enmantecar el molde"
        ],
        "steps": [
            "Precalentar el horno a 180 grados",
            "En un bol grande, batir los huevos con el azúcar hasta obtener una mezcla espumosa",
            "Añadir el aceite, el jugo de naranja y la ralladura de naranja y mezclar bien hasta integrar",
            "Añadir la harina tamizada y la levadura en polvo y mezclar suavemente hasta que quede homogéneo",
            "Enmantecar y enharinar un molde para bizcochos (22 cm aprox.) y verter la mezcla",
            "Hornear durante 35-45 minutos o hasta que el bizcocho esté doradito y firme al tacto. Dejar enfriar completamente antes de desmoldar y servir"
        ],
        "imgUrl": "https://www.paulinacocina.net/wp-content/uploads/2023/05/como-hacer-bizcocho-de-naranja.jpg",
        "videoUrl": "https://www.youtube.com/embed/NPv_05vZjKs?si=tm2LFxWkpviJvXtx",
        "description":
        [
            "El bizcocho de naranja, también conocido como bizcochuelo de naranja, es un clásico de la repostería que le gusta a (casi) todo el mundo. Es una receta fácil y sabrosa, ideal para comer en una tarde con una amiga, llevar a la casa de alguien que nos invitó a la hora del té, o para disfrutar viendo una película con un rico café con leche",
            "El bizcocho de naranja, es una opción perfecta para disfrutar en el desayuno y en la merienda, o cuando tengamos ganas, y su sabor fresco y cítrico lo hace ideal para cualquier época del año. Queda muy bien con un glaseado de naranja, azúcar glas (impalpable), cascaritas de naranja azucaradas, o simplemente así como sale del horno"
        ]
    },
    {
        "id": 4,
        "name": "Lemon Pie",
        "ingredients": [
            "200g. de galletitas de vainilla",
            "70g. de manteca",
            "4 huevos",
            "1 lata de leche condensada",
            "1/2 vaso de jugo de limón",
            "Ralladura de medio limón",
            "200g. de azúcar"
        ],
        "steps": [
            "Moler 200 gr de galletitas de vainilla y colocar en un recipiente.",
            "Agregar 80-100 gr de manteca derretida. Utilizamos las manos para mezclar hasta que quede con consistencia de arena mojada (ustedes me entienden)",
            "Desparramar la preparación obtenida en una tartera. Aplastarlo bien con las manos",
            "Por otro lado la crema de limón: separamos yemas y claras de 4 huevos. Colocamos las yemas en un recipiente, agregamos una lata (400gr) de leche condensada y mezclar. Esta receta de lemon pie lleva medio vaso de jugo de limón que se lo agregamos en este momento, junto con rayadura de cáscara. Batimos hasta lograr una consistencia espesa",
            "Agregamos la crema de limón encima de la masa que preparamos al principio en la tartera",
            "Y ahora el merengue francés: empezamos batiendo las 4 claras con batidora hasta que levanten (como si fuera espuma). Agregamos 200 gr de azucar en forma de lluvia sin dejar de batir, seguimos batiendo hasta lograr la consistencia deseada (bien espeso)",
            "Agregamos el merengue encima de la crema de limón en la tartera. Con una cuchara distribuimos y damos al merengue la forma que deseamos (o la que podamos)",
            "Poner al horno (en la bandeja más alta posible o en la parrilla del horno) bien caliente. Estén atentos que es apenas un ratito para que se dore el merengue!",
            "La receta de lemon pie está lista!"
        ],
        "imgUrl": "https://www.paulinacocina.net/wp-content/uploads/2022/06/Como-hacer-Lemon-Pie-con-galletitas-800x534.jpg",
        "videoUrl": "https://www.youtube.com/embed/9yuxHcfTczw?si=p9Gx1AwkyMBmOeHU",
        "description":
        [
            "La tarta de limón es una tarta formada por una base de masa quebrada u hojaldre que se rellena con crema de limón",
            "Esta tarta a menudo se complementa con un merengue, lo que resulta en tarta de limón con merengue",
            "Se compone de una base de masa y un relleno. Como su nombre indica está hecha con limón, más bien con el zumo del limón, azúcar y huevos. Todo ello mezclado hace el famoso custard, el relleno cremoso amarillo que es tan típico de la tarta de limón. Una aclaración: el lemon pie original, el clásico, el infaltable de cada banquete que daba la reina Isabel I de Inglaterra, no necesariamente lleva esa cobertura blanca esponjosa con que se conoce en la actualidad."
        ]
    }
]